Tekla.Structures.Model.RebarLeg
This represents a leg of a rebar and is used in the Tekla.Structures.Model.RebarComplexGeometry class.

Tekla.Structures.Model.RebarLeg.#ctor(Tekla.Structures.Geometry3d.ICurve,Tekla.Structures.Model.RebarLeg.OriginEnum)
Initializes a new instance of the Tekla.Structures.Model.RebarLeg class.
curve: The leg curve.
origin: The leg origin.

Tekla.Structures.Model.RebarLeg.Curve
Gets the curve of the leg

Tekla.Structures.Model.RebarLeg.Origin
Gets the origin of the leg